tutorials/fluidSolidInteraction/heatTransfer/flowOverHeatedPlate/constant/fluid/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh staticFvMesh;

// dynamicFvMesh dynamicMotionSolverFvMesh;

// solver velocityLaplacian;

// diffusivity quadratic inverseDistance (interface);

// ************************************************************************* //
